Only when it's autogenerated, (known after apply) message will appear. For example, if we have a config like:

```tf
resource "deno_project" "sample_project" {}

resource "deno_project" "sample_project2" {
  name = "myproject"
}
```

Then terraform plan will show us:

```
  # deno_project.sample_project will be created
  + resource "deno_project" "sample_project" {
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + updated_at = (known after apply)
    }

  # deno_project.sample_project2 will be created
  + resource "deno_project" "sample_project2" {
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = "myproject"
      + updated_at = (known after apply)
    }
```